import { Select2Data } from 'projects/ng-select2-component/src/public_api';

export const data1: Select2Data = [
    {
        label: 'Alaskan/Hawaiian Time Zone',
        options: [
            { value: 'AK', label: 'Alaska' },
            { value: 'HI', label: 'Hawaii', disabled: true },
        ],
    },
    {
        label: 'Pacific Time Zone',
        options: [
            { value: 'CA', label: 'California' },
            { value: 'NV', label: 'Nevada' },
            { value: 'OR', label: 'Oregon' },
            { value: 'WA', label: 'Washington' },
        ],
    },
    {
        label: 'Mountain Time Zone',
        options: [
            { value: 'AZ', label: 'Arizona' },
            { value: 'CO', label: 'Colorado' },
            { value: 'ID', label: 'Idaho' },
            { value: 'MT', label: 'Montana' },
            { value: 'NE', label: 'Nebraska' },
            { value: 'NM', label: 'New Mexico' },
            { value: 'ND', label: 'North Dakota' },
            { value: 'UT', label: 'Utah' },
            { value: 'WY', label: 'Wyoming' },
        ],
    },
    {
        label: 'Central Time Zone',
        options: [
            { value: 'AL', label: 'Alabama' },
            { value: 'AR', label: 'Arkansas' },
            { value: 'IL', label: 'Illinois' },
            { value: 'IA', label: 'Iowa' },
            { value: 'KS', label: 'Kansas' },
            { value: 'KY', label: 'Kentucky' },
            { value: 'LA', label: 'Louisiana' },
            { value: 'MN', label: 'Minnesota' },
            { value: 'MS', label: 'Mississippi' },
            { value: 'MO', label: 'Missouri' },
            { value: 'OK', label: 'Oklahoma' },
            { value: 'SD', label: 'South Dakota' },
            { value: 'TX', label: 'Texas' },
            { value: 'TN', label: 'Tennessee' },
            { value: 'WI', label: 'Wisconsin' },
        ],
    },
    {
        label: 'Eastern Time Zone',
        options: [
            { value: 'CT', label: 'Connecticut' },
            { value: 'DE', label: 'Delaware' },
            { value: 'FL', label: 'Florida' },
            { value: 'GA', label: 'Georgia' },
            { value: 'IN', label: 'Indiana' },
            { value: 'ME', label: 'Maine' },
            { value: 'MD', label: 'Maryland' },
            { value: 'MA', label: 'Massachusetts' },
            { value: 'MI', label: 'Michigan' },
            { value: 'NH', label: 'New Hampshire' },
            { value: 'NJ', label: 'New Jersey' },
            { value: 'NY', label: 'New York' },
            { value: 'NC', label: 'North Carolina' },
            { value: 'OH', label: 'Ohio' },
            { value: 'PA', label: 'Pennsylvania' },
            { value: 'RI', label: 'Rhode Island' },
            { value: 'SC', label: 'South Carolina' },
            { value: 'VT', label: 'Vermont' },
            { value: 'VA', label: 'Virginia' },
            { value: 'WV', label: 'West Virginia' },
        ],
    },
];

export const data2: Select2Data = [
    { value: 'AK', label: 'Alaska' },
    { value: 'HI', label: 'Hawaii', disabled: true },
    { value: 'CA', label: 'California' },
    { value: 'NV', label: 'Nevada' },
    { value: 'OR', label: 'Oregon' },
    { value: 'WA', label: 'Washington' },
    { value: 'AZ', label: 'Arizona' },
    { value: 'CO', label: 'Colorado' },
    { value: 'ID', label: 'Idaho' },
    { value: 'MT', label: 'Montana' },
    { value: 'NE', label: 'Nebraska' },
    { value: 'NM', label: 'New Mexico' },
    { value: 'ND', label: 'North Dakota' },
    { value: 'UT', label: 'Utah' },
    { value: 'WY', label: 'Wyoming' },
    { value: 'AL', label: 'Alabama' },
    { value: 'AR', label: 'Arkansas' },
    { value: 'IL', label: 'Illinois' },
    { value: 'IA', label: 'Iowa' },
    { value: 'KS', label: 'Kansas' },
    { value: 'KY', label: 'Kentucky' },
    { value: 'LA', label: 'Louisiana' },
    { value: 'MN', label: 'Minnesota' },
    { value: 'MS', label: 'Mississippi' },
    { value: 'MO', label: 'Missouri' },
    { value: 'OK', label: 'Oklahoma' },
    { value: 'SD', label: 'South Dakota' },
    { value: 'TX', label: 'Texas' },
    { value: 'TN', label: 'Tennessee' },
    { value: 'WI', label: 'Wisconsin' },
    { value: 'CT', label: 'Connecticut' },
    { value: 'DE', label: 'Delaware' },
    { value: 'FL', label: 'Florida' },
    { value: 'GA', label: 'Georgia' },
    { value: 'IN', label: 'Indiana' },
    { value: 'ME', label: 'Maine' },
    { value: 'MD', label: 'Maryland' },
    { value: 'MA', label: 'Massachusetts' },
    { value: 'MI', label: 'Michigan' },
    { value: 'NH', label: 'New Hampshire' },
    { value: 'NJ', label: 'New Jersey' },
    { value: 'NY', label: 'New York' },
    { value: 'NC', label: 'North Carolina' },
    { value: 'OH', label: 'Ohio' },
    { value: 'PA', label: 'Pennsylvania' },
    { value: 'RI', label: 'Rhode Island' },
    { value: 'SC', label: 'South Carolina' },
    { value: 'VT', label: 'Vermont' },
    { value: 'VA', label: 'Virginia', disabled: true },
    { value: 'WV', label: 'West Virginia' },
];

export const data3: Select2Data = [
    { value: 'foo', label: 'foo' },
    { value: 'bar', label: 'bar' },
    { value: 'baz', label: 'baz' },
];

export const data5: Select2Data = [
    { value: 0, label: '0' },
    { value: 1, label: '1' },
    { value: 2, label: '2' },
    { value: 3, label: '3' },
    { value: 4, label: '4' },
    { value: 5, label: '5' },
    { value: 6, label: '6' },
];

export const data6: Select2Data = [
    { value: 'foo1', label: 'foo1' },
    { value: 'foo2', label: 'foo2' },
    { value: 'foo3', label: 'foo3' },
    { value: 'foo4', label: 'foo4' },
    { value: 'foo5', label: 'foo5' },
    { value: 'foo6', label: 'foo6' },
];

export const data8: Select2Data = [
    { value: 'FR-ARA', label: 'Auvergne-Rhône-Alpes' },
    { value: 'FR-BFC', label: 'Bourgogne-Franche-Comté' },
    { value: 'FR-BRE', label: 'Bretagne' },
    { value: 'FR-CVL', label: 'Centre-Val de Loire' },
    { value: 'FR-COR', label: 'Corse' },
    { value: 'FR-GES', label: 'Grand Est' },
    { value: 'FR-HDF', label: 'Hauts-de-France' },
    { value: 'FR-IDF', label: 'Île-de-France' },
    { value: 'FR-NOR', label: 'Normandie' },
    { value: 'FR-NAQ', label: 'Nouvelle-Aquitaine' },
    { value: 'FR-OCC', label: 'Occitanie' },
    { value: 'FR-PDL', label: 'Pays de la Loire' },
    { value: 'FR-PAC', label: "Provence-Alpes-Côte d'Azur" },
    { value: 'FR-GP', label: 'Guadeloupe' },
    { value: 'FR-MQ', label: 'Martinique' },
    { value: 'FR-GF', label: 'Guyane' },
    { value: 'FR-RE', label: 'La Réunion' },
    { value: 'FR-YT', label: 'Mayotte' },
];

export const data18: Select2Data = [
    {
        label: 'Mainland region',
        options: [
            { value: 'FR-ARA', label: 'Auvergne-Rhône-Alpes' },
            { value: 'FR-BFC', label: 'Bourgogne-Franche-Comté' },
            { value: 'FR-BRE', label: 'Bretagne' },
            { value: 'FR-CVL', label: 'Centre-Val de Loire' },
            { value: 'FR-COR', label: 'Corse' },
            { value: 'FR-GES', label: 'Grand Est' },
            { value: 'FR-HDF', label: 'Hauts-de-France' },
            { value: 'FR-IDF', label: 'Île-de-France' },
            { value: 'FR-NOR', label: 'Normandie' },
            { value: 'FR-NAQ', label: 'Nouvelle-Aquitaine' },
            { value: 'FR-OCC', label: 'Occitanie' },
            { value: 'FR-PDL', label: 'Pays de la Loire' },
            { value: 'FR-PAC', label: "Provence-Alpes-Côte d'Azur" },
        ],
    },
    {
        label: 'Overseas region',
        options: [
            { value: 'FR-GP', label: 'Guadeloupe' },
            { value: 'FR-MQ', label: 'Martinique' },
            { value: 'FR-GF', label: 'Guyane' },
            { value: 'FR-RE', label: 'La Réunion' },
            { value: 'FR-YT', label: 'Mayotte' },
        ],
    },
];

export const data19: Select2Data = [
    { value: 'foo1', label: 'foo1' },
    { value: 'foo2', label: 'foo2' },
    { value: 'foo3', label: 'foo3' },
    { value: 'foo4', label: 'foo4' },
    { value: 'foo5', label: 'foo5' },
    { value: 'foo6', label: 'foo6' },
    { value: 'foo7', label: 'foo7' },
    { value: 'foo8', label: 'foo8' },
    { value: 'foo9', label: 'foo9', hide: true },
];

export const data13: Select2Data = [
    { value: true, label: 'true' },
    { value: false, label: 'false' },
];

export const data17: Select2Data = [
    {
        value: 'fr',
        label: `<div class="select2-multiple-labels">
                    <div>France</div>
                    <div>Europe</div>
                </div>`,
    },
    {
        value: 'sp',
        label: `<div class="select2-multiple-labels">
                    <div>Spain</div>
                    <div>Europe</div>
                </div>`,
    },
    {
        value: 'ch',
        label: `<div class="select2-multiple-labels">
                    <div>China</div>
                    <div>Asia</div>
                </div>`,
    },
];

export const data22: Select2Data = [
    { value: 'heliotrope', label: 'Heliotrope', classes: 'white flower', id: 'option-heliotrope' },
    { value: 'hibiscus', label: 'Hibiscus', classes: 'red flower', id: 'option-hibiscus' },
    { value: 'lily', label: 'Lily', classes: 'white flower', id: 'option-lily' },
    { value: 'marigold', label: 'Marigold', classes: 'red flower', id: 'option-marigold' },
    { value: 'petunia', label: 'Petunia', classes: 'white flower', id: 'option-petunia' },
    { value: 'sunflower', label: 'Sunflower', classes: 'yellow flower', id: 'option-sunflower' },
];

export const data23: Select2Data = [
    {
        value: 'heliotrope',
        label: 'Heliotrope',
        data: { color: 'white', name: 'Heliotrope' },
        templateId: 'template1',
        id: 'option-heliotrope',
    },
    {
        value: 'hibiscus',
        label: 'Hibiscus',
        data: { color: 'red', name: 'Hibiscus' },
        templateId: 'template1',
        id: 'option-hibiscus',
    },
    {
        value: 'lily',
        label: 'Lily',
        data: { color: 'white', name: 'Lily' },
        templateId: 'template2',
        id: 'option-lily',
    },
    {
        value: 'marigold',
        label: 'Marigold',
        data: { color: 'red', name: 'Marigold' },
        templateId: 'template2',
        id: 'option-marigold',
    },
    {
        value: 'petunia',
        label: 'Petunia',
        data: { color: 'white', name: 'Petunia' },
        templateId: 'template3',
        id: 'option-petunia',
    },
    {
        value: 'sunflower',
        label: 'Sunflower',
        data: { color: 'yellow', name: 'Sunflower' },
        templateId: 'template3',
        id: 'option-sunflower',
    },
];

export const data24: Select2Data = [
    {
        label: 'Red',
        data: { name: '(Red)' },
        options: [
            {
                value: 'hibiscus',
                label: 'Hibiscus',
                data: { color: 'red', name: 'Hibiscus' },
                templateId: 'template1',
                id: 'option-hibiscus',
            },
            {
                value: 'marigold',
                label: 'Marigold',
                data: { color: 'red', name: 'Marigold' },
                templateId: 'template2',
                id: 'option-marigold',
            },
        ],
    },
    {
        label: 'Yellow',
        data: { name: '(Yellow)' },
        options: [
            {
                value: 'sunflower',
                label: 'Sunflower',
                data: { color: 'yellow', name: 'Sunflower' },
                templateId: 'template3',
                id: 'option-sunflower',
            },
        ],
    },
    {
        label: 'White',
        data: { name: '(White)' },
        options: [
            {
                value: 'heliotrope',
                label: 'Heliotrope',
                data: { color: 'white', name: 'Heliotrope' },
                templateId: 'template1',
                id: 'option-heliotrope',
            },
            {
                value: 'lily',
                label: 'Lily',
                data: { color: 'white', name: 'Lily' },
                templateId: 'template2',
                id: 'option-lily',
            },
            {
                value: 'petunia',
                label: 'Petunia',
                data: { color: 'white', name: 'Petunia' },
                templateId: 'template3',
                id: 'option-petunia',
            },
        ],
    },
];

export const data26: Select2Data = [];
for (let i = 1; i <= 50; i++) {
    data26.push({ value: i, label: '>' + i });
}

export const data28: Select2Data = [];
for (let i = 1; i <= 200; i++) {
    data28.push({ value: i, label: 'item n° ' + i });
}

export const data31en: Select2Data = [
    { value: 'english', label: 'English' },
    { value: 'french', label: 'French' },
    { value: 'japanese', label: 'Japanese' },
];
export const data31fr: Select2Data = [
    { value: 'english', label: 'Anglais' },
    { value: 'french', label: 'Français' },
    { value: 'japanese', label: 'Japonais' },
];
export const data31ja: Select2Data = [
    { value: 'english', label: '英語' },
    { value: 'french', label: 'フランス語' },
    { value: 'japanese', label: '日本語' },
];

export const data35: Select2Data = Array.from(
    '😀😃😄😁😆😅🤣😂🙂🙃🫠😉😊😇🥰😍🤩😘😗☺️😚😙🥲😋😛😜🤪😝🤑🤗🤭🫢🫣🤫🤔🫡🤐🤨😐️😑😶🫥😶‍🌫️😏😒🙄😬😮‍💨🤥🫨🙂‍↔️🙂‍↕️😌😔😪\
🤤😴😷🤒🤕🤢🤮🤧🥵🥶🥴😵😵‍💫🤯🤠🥳🥸😎🤓🧐😕🫤😟🙁☹️😮😯😲😳🥺🥹😦😧😨😰😥😢😭😱😖😣😞😓😩😫🥱😤😡😠🤬😈👿💀☠️💩🤡👹👺\
👻👽️👾🤖😺😸😹😻😼😽🙀😿😾🙈🙉🙊💌💘💝💖💗💓💞💕💟❣️💔❤️‍🔥❤️‍🩹❤️🩷🧡💛💚💙🩵💜🤎🖤🩶🤍💋💯💢💥💫💦💨🕳️💬👁️‍🗨️🗨️🗯️💭💤',
).map(e => ({ value: e, label: e }));

export const data35b: Select2Data = Object.entries({
    '❤️🤣Smileys et émotions':
        '😀😃😄😁😆😅🤣😂🙂🙃🫠😉😊😇🥰😍🤩😘😗☺️😚😙🥲😋😛😜🤪😝🤑🤗🤭🫢🫣🤫🤔🫡🤐🤨😐️😑😶🫥😶‍🌫️😏😒🙄😬😮‍💨🤥🫨🙂‍↔️🙂‍↕️😌\
😔😪🤤😴😷🤒🤕🤢🤮🤧🥵🥶🥴😵😵‍💫🤯🤠🥳🥸😎🤓🧐😕🫤😟🙁☹️😮😯😲😳🥺🥹😦😧😨😰😥😢😭😱😖😣😞😓😩😫🥱😤😡😠🤬😈👿💀☠️💩🤡\
👹👺👻👽️👾🤖😺😸😹😻😼😽🙀😿😾🙈🙉🙊💌💘💝💖💗💓💞💕💟❣️💔❤️‍🔥❤️‍🩹❤️🩷🧡💛💚💙🩵💜🤎🖤🩶🤍💋💯💢💥💫💦💨🕳️💬👁️‍🗨️🗨️🗯️💭💤',
    '👍️🙋‍♂️Personnes et corps':
        '👋🤚🖐️✋️🖖🫱🫲🫳🫴🫷🫸👌🤌🤏✌️🤞🫰🤟🤘🤙👈️👉️👆️🖕👇️☝️🫵👍️👎️✊️👊🤛🤜👏🙌🫶👐🤲🤝🙏✍️💅🤳💪🦾🦿🦵🦶👂️🦻👃🧠🫀🫁\
🦷🦴👀👁️👅👄🫦👶🧒👦👧🧑👱👨🧔🧔‍♂️🧔‍♀️👨‍🦰👨‍🦱👨‍🦳👨‍🦲👩👩‍🦰🧑‍🦰👩‍🦱🧑‍🦱👩‍🦳🧑‍🦳👩‍🦲🧑‍🦲👱‍♀️👱‍♂️🧓👴👵🙍🙍‍♂️🙍‍♀️🙎🙎‍♂️🙎‍♀️🙅🙅‍♂️🙅‍♀️🙆🙆‍♂️🙆‍♀️💁💁‍♂️💁‍♀️🙋🙋‍♂️🙋‍♀️🧏🧏‍♂️🧏‍♀️🙇\
🙇‍♂️🙇‍♀️🤦🤦‍♂️🤦‍♀️🤷🤷‍♂️🤷‍♀️🧑‍⚕️👨‍⚕️👩‍⚕️🧑‍🎓👨‍🎓👩‍🎓🧑‍🏫👨‍🏫👩‍🏫🧑‍⚖️👨‍⚖️👩‍⚖️🧑‍🌾👨‍🌾👩‍🌾🧑‍🍳👨‍🍳👩‍🍳🧑‍🔧👨‍🔧👩‍🔧🧑‍🏭👨‍🏭👩‍🏭🧑‍💼👨‍💼👩‍💼🧑‍🔬👨‍🔬👩‍🔬🧑‍💻👨‍💻👩‍💻🧑‍🎤👨‍🎤👩‍🎤🧑‍🎨👨‍🎨👩‍🎨🧑‍✈️👨‍✈️👩‍✈️🧑‍🚀👨‍🚀👩‍🚀🧑‍🚒👨‍🚒👩‍🚒👮\
👮‍♂️👮‍♀️🕵️🕵️‍♂️🕵️‍♀️💂💂‍♂️💂‍♀️🥷👷👷‍♂️👷‍♀️🫅🤴👸👳👳‍♂️👳‍♀️👲🧕🤵🤵‍♂️🤵‍♀️👰👰‍♂️👰‍♀️🤰🫃🫄🤱👩‍🍼👨‍🍼🧑‍🍼👼🎅🤶🧑‍🎄🦸🦸‍♂️🦸‍♀️🦹🦹‍♂️🦹‍♀️🧙🧙‍♂️🧙‍♀️🧚🧚‍♂️🧚‍♀️🧛🧛‍♂️🧛‍♀️🧜🧜‍♂️🧜‍♀️🧝🧝‍♂️\
🧝‍♀️🧞🧞‍♂️🧞‍♀️🧟🧟‍♂️🧟‍♀️🧌💆💆‍♂️💆‍♀️💇💇‍♂️💇‍♀️🚶🚶‍♂️🚶‍♀️🚶‍➡️🚶‍♀️‍🚶‍♂️‍🧍🧍‍♂️🧍‍♀️🧎🧎‍♂️🧎‍♀️🧎‍➡️🧎‍♀️‍🧎‍♂️‍🧑‍🦯🧑‍🦯‍➡👨‍🦯👨‍🦯‍➡👩‍🦯👩‍🦯‍➡🧑‍🦼🧑‍🦼‍➡👨‍🦼👨‍🦼‍➡👩‍🦼👩‍🦼‍➡🧑‍🦽🧑‍🦽‍➡👨‍🦽👨‍🦽‍➡👩‍🦽👩‍🦽‍➡🏃🏃‍♂️🏃‍♀️🏃‍➡️🏃‍♀️‍🏃‍♂️‍💃🕺🕴️👯\
👯‍♂️👯‍♀️🧖🧖‍♂️🧖‍♀️🧗🧗‍♂️🧗‍♀️🤺🏇⛷️🏂️🏌️🏌️‍♂️🏌️‍♀️🏄️🏄‍♂️🏄‍♀️🚣🚣‍♂️🚣‍♀️🏊️🏊‍♂️🏊‍♀️⛹️⛹️‍♂️⛹️‍♀️🏋️🏋️‍♂️🏋️‍♀️🚴🚴‍♂️🚴‍♀️🚵🚵‍♂️🚵‍♀️🤸🤸‍♂️🤸‍♀️🤼🤼‍♂️🤼‍♀️🤽🤽‍♂️🤽‍♀️🤾🤾‍♂️🤾‍♀️🤹🤹‍♂️🤹‍♀️🧘🧘‍♂️🧘‍♀️🛀🛌🧑‍🤝‍🧑\
👭👫👬💏👩‍❤️‍👨‍❤️‍👩‍❤️‍💑👩‍❤️‍👨‍❤️‍👩‍❤️‍👨‍👩‍👦👨‍👩‍👧👨‍👩‍👧👨‍👩‍👦👨‍👩‍👧👨‍👨‍👦👨‍👨‍👧👨‍👨‍👧👨‍👨‍👦👨‍👨‍👧👩‍👩‍👦👩‍👩‍👧👩‍👩‍👧👩‍👩‍👦👩‍👩‍👧👨‍👦👨‍👦‍👦👨‍👧👨‍👧‍👦👨‍👧‍👧👩‍👦👩‍👦‍👦👩‍👧👩‍👧‍👦👩‍👧‍👧🗣️👤👥🫂👪️🧑‍🧑‍🧒🧑‍🧑‍🧒🧑‍🧒🧑‍🧒‍🧒👣',
    '🌴🦁Animaux et nature':
        '🐵🐒🦍🦧🐶🐕️🦮🐕‍🦺🐩🐺🦊🦝🐱🐈️🐈‍⬛🦁🐯🐅🐆🐴🫎🫏🐎🦄🦓🦌🦬🐮🐂🐃🐄🐷🐖🐗🐽🐏🐑🐐🐪🐫🦙🦒🐘🦣🦏🦛🐭🐁🐀🐹🐰🐇🐿️\
🦫🦔🦇🐻🐻‍❄️🐨🐼🦥🦦🦨🦘🦡🐾🦃🐔🐓🐣🐤🐥🐦️🐧🕊️🦅🦆🦢🦉🦤🪶🦩🦚🦜🪽🐦‍⬛🪿🐦‍🔥🐸🐊🐢🦎🐍🐲🐉🦕🦖🐳🐋🐬🦭🐟️🐠🐡🦈🐙🐚🪸🪼🐌\
🦋🐛🐜🐝🪲🐞🦗🪳🕷️🕸️🦂🦟🪰🪱🦠💐🌸💮🪷🏵️🌹🥀🌺🌻🌼🌷🪻🌱🪴🌲🌳🌴🌵🌾🌿☘️🍀🍁🍂🍃🪹🪺🍄',
    '🍜🍸️Nourriture et boissons':
        '🍇🍈🍉🍊🍋🍋‍🟩🍌🍍🥭🍎🍏🍐🍑🍒🍓🫐🥝🍅🫒🥥🥑🍆🥔🥕🌽🌶️🫑🥒🥬🥦🧄🧅🥜🫘🌰🫚🫛🍄‍🟫🍞🥐🥖🫓🥨🥯🥞🧇🧀🍖🍗🥩🥓🍔\
🍟🍕🌭🥪🌮🌯🫔🥙🧆🥚🍳🥘🍲🫕🥣🥗🍿🧈🧂🥫🍱🍘🍙🍚🍛🍜🍝🍠🍢🍣🍤🍥🥮🍡🥟🥠🥡🦀🦞🦐🦑🦪🍦🍧🍨🍩🍪🎂🍰🧁🥧🍫🍬🍭🍮🍯\
🍼🥛☕️🫖🍵🍶🍾🍷🍸️🍹🍺🍻🥂🥃🫗🥤🧋🧃🧉🧊🥢🍽️🍴🥄🔪🫙🏺',
    '✈️⛅️Voyages, lieux et météo':
        '🌍️🌎️🌏️🌐🗺️🗾🧭🏔️⛰️🌋🗻🏕️🏖️🏜️🏝️🏞️🏟️🏛️🏗️🧱🪨🪵🛖🏘️🏚️🏠️🏡🏢🏣🏤🏥🏦🏨🏩🏪🏫🏬🏭️🏯🏰💒🗼🗽⛪️🕌🛕🕍⛩️🕋⛲️⛺️🌁\
🌃🏙️🌄🌅🌆🌇🌉♨️🎠🛝🎡🎢💈🎪🚂🚃🚄🚅🚆🚇️🚈🚉🚊🚝🚞🚋🚌🚍️🚎🚐🚑️🚒🚓🚔️🚕🚖🚗🚘️🚙🛻🚚🚛🚜🏎️🏍️🛵🦽🦼🛺🚲️🛴🛹🛼🚏🛣️🛤️🛢️\
⛽️🛞🚨🚥🚦🛑🚧⚓️🛟⛵️🛶🚤🛳️⛴️🛥️🚢✈️🛩️🛫🛬🪂💺🚁🚟🚠🚡🛰️🚀🛸🛎️🧳⌛️⏳️⌚️⏰️⏱️⏲️🕰️🕛️🕧️🕐️🕜️🕑️🕝️🕒️🕞️🕓️🕟️🕔️🕠️🕕️🕡️🕖️🕢️🕗️🕣️🕘️🕤️\
🕙️🕥️🕚️🕦️🌑🌒🌓🌔🌕️🌖🌗🌘🌙🌚🌛🌜️🌡️☀️🌝🌞🪐⭐️🌟🌠🌌☁️⛅️⛈️🌤️🌥️🌦️🌧️🌨️🌩️🌪️🌫️🌬️🌀🌈🌂☂️☔️⛱️⚡️❄️☃️⛄️☄️🔥💧🌊',
    '⚽️🎮️Activités et événements':
        '🎃🎄🎆🎇🧨✨️🎈🎉🎊🎋🎍🎎🎏🎐🎑🧧🎀🎁🎗️🎟️🎫🎖️🏆️🏅🥇🥈🥉⚽️⚾️🥎🏀🏐🏈🏉🎾🥏🎳🏏🏑🏒🥍🏓🏸🥊🥋🥅⛳️⛸️🎣🤿🎽🎿\
🛷🥌🎯🪀🪁🔫🎱🔮🪄🎮️🕹️🎰🎲🧩🧸🪅🪩🪆♠️♥️♦️♣️♟️🃏🀄️🎴🎭️🖼️🎨🧵🪡🧶🪢',
    '💻️🪥Objets':
        '👓️🕶️🥽🥼🦺👔👕👖🧣🧤🧥🧦👗👘🥻🩱🩲🩳👙👚🪭👛👜👝🛍️🎒🩴👞👟🥾🥿👠👡🩰👢🪮👑👒🎩🎓️🧢🪖⛑️📿💄💍💎🔇🔈️🔉🔊📢\
📣📯🔔🔕🎼🎵🎶🎙️🎚️🎛️🎤🎧️📻️🎷🪗🎸🎹🎺🎻🪕🥁🪘🪇🪈📱📲☎️📞📟️📠🔋🪫🔌💻️🖥️🖨️⌨️🖱️🖲️💽💾💿️📀🧮🎥🎞️📽️🎬️📺️📷️📸📹️📼🔍️🔎🕯️💡\
🔦🏮🪔📔📕📖📗📘📙📚️📓📒📃📜📄📰🗞️📑🔖🏷️💰️🪙💴💵💶💷💸💳️🧾💹✉️📧📨📩📤️📥️📦️📫️📪️📬️📭️📮🗳️✏️✒️🖋️🖊️🖌️🖍️📝💼📁📂🗂️📅📆🗒️🗓️\
📇📈📉📊📋️📌📍📎🖇️📏📐✂️🗃️🗄️🗑️🔒️🔓️🔏🔐🔑🗝️🔨🪓⛏️⚒️🛠️🗡️⚔️💣️🪃🏹🛡️🪚🔧🪛🔩⚙️🗜️⚖️🦯🔗⛓️‍💥⛓️🪝🧰🧲🪜⚗️🧪🧫🧬🔬🔭📡💉🩸💊🩹🩼\
🩺🩻🚪🛗🪞🪟🛏️🛋️🪑🚽🪠🚿🛁🪤🪒🧴🧷🧹🧺🧻🪣🧼🫧🪥🧽🧯🛒🚬⚰️🪦⚱️🧿🪬🗿🪧🪪',
    '✅️⚠️Symboles':
        '🏧🚮🚰♿️🚹️🚺️🚻🚼️🚾🛂🛃🛄🛅⚠️🚸⛔️🚫🚳🚭️🚯🚱🚷📵🔞☢️☣️⬆️↗️➡️↘️⬇️↙️⬅️↖️↕️↔️↩️↪️⤴️⤵️🔃🔄🔙🔚🔛🔜🔝🛐⚛️🕉️✡️☸️☯️✝️☦️☪️☮️🕎🔯🪯♈️♉️♊️♋️♌️♍️♎️♏️♐️♑️\
♒️♓️⛎️🔀🔁🔂▶️⏩️⏭️⏯️◀️⏪️⏮️🔼⏫️🔽⏬️⏸️⏹️⏺️⏏️🎦🔅🔆📶🛜📳📴♀️♂️⚧️✖️➕️➖️➗️🟰♾️‼️⁉️❓️❔️❕️❗️〰️💱💲⚕️♻️⚜️🔱📛🔰⭕️✅️☑️✔️❌️❎️➰️➿️〽️✳️✴️❇️©️®️™️\
#️⃣*️⃣0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🔟🔠🔡🔢🔣🔤🅰️🆎🅱️🆑🆒🆓ℹ️🆔Ⓜ️🆕🆖🅾️🆗🅿️🆘🆙🆚🈁🈂️🈷️🈶🈯️🉐🈹🈚️🈲🉑🈸🈴🈳㊗️㊙️🈺🈵🔴🟠🟡🟢\
🔵🟣🟤⚫️⚪️🟥🟧🟨🟩🟦🟪🟫⬛️⬜️◼️◻️◾️◽️▪️▫️🔶🔷🔸🔹🔺🔻💠🔘🔳🔲',
    '🇨🇵 🚩Drapeaux':
        '🏁🚩🎌🏴🏳️🏳️‍🌈🏳️‍⚧️🏴‍☠️🇦🇨🇦🇩🇦🇪🇦🇫🇦🇬🇦🇮🇦🇱🇦🇲🇦🇴🇦🇶🇦🇷🇦🇸🇦🇹🇦🇺🇦🇼🇦🇽🇦🇿🇧🇦🇧🇧🇧🇩🇧🇪🇧🇫🇧🇬🇧🇭🇧🇮🇧🇯🇧🇱🇧🇲🇧🇳🇧🇴🇧🇶🇧🇷🇧🇸🇧🇹🇧🇻🇧🇼🇧🇾🇧🇿🇨🇦🇨🇨🇨🇩🇨🇫🇨🇬🇨🇭\
🇨🇮🇨🇰🇨🇱🇨🇲🇨🇳🇨🇴🇨🇵🇨🇷🇨🇺🇨🇻🇨🇼🇨🇽🇨🇾🇨🇿🇩🇪🇩🇬🇩🇯🇩🇰🇩🇲🇩🇴🇩🇿🇪🇦🇪🇨🇪🇪🇪🇬🇪🇭🇪🇷🇪🇸🇪🇹🇪🇺🇫🇮🇫🇯🇫🇰🇫🇲🇫🇴🇫🇷🇬🇦🇬🇧🇬🇩🇬🇪🇬🇫🇬🇬🇬🇭🇬🇮🇬🇱🇬🇲🇬🇳🇬🇵🇬🇶🇬🇷🇬🇸🇬🇹🇬🇺🇬🇼🇬🇾🇭🇰🇭🇲\
🇭🇳🇭🇷🇭🇹🇭🇺🇮🇨🇮🇩🇮🇪🇮🇱🇮🇲🇮🇳🇮🇴🇮🇶🇮🇷🇮🇸🇮🇹🇯🇪🇯🇲🇯🇴🇯🇵🇰🇪🇰🇬🇰🇭🇰🇮🇰🇲🇰🇳🇰🇵🇰🇷🇰🇼🇰🇾🇰🇿🇱🇦🇱🇧🇱🇨🇱🇮🇱🇰🇱🇷🇱🇸🇱🇹🇱🇺🇱🇻🇱🇾🇲🇦🇲🇨🇲🇩🇲🇪🇲🇫🇲🇬🇲🇭🇲🇰🇲🇱🇲🇲🇲🇳🇲🇴🇲🇵🇲🇶🇲🇷🇲🇸\
🇲🇹🇲🇺🇲🇻🇲🇼🇲🇽🇲🇾🇲🇿🇳🇦🇳🇨🇳🇪🇳🇫🇳🇬🇳🇮🇳🇱🇳🇴🇳🇵🇳🇷🇳🇺🇳🇿🇴🇲🇵🇦🇵🇪🇵🇫🇵🇬🇵🇭🇵🇰🇵🇱🇵🇲🇵🇳🇵🇷🇵🇸🇵🇹🇵🇼🇵🇾🇶🇦🇷🇪🇷🇴🇷🇸🇷🇺🇷🇼🇸🇦🇸🇧🇸🇨🇸🇩🇸🇪🇸🇬🇸🇭🇸🇮🇸🇯🇸🇰🇸🇱🇸🇲🇸🇳🇸🇴🇸🇷🇸🇸🇸🇹\
🇸🇻🇸🇽🇸🇾🇸🇿🇹🇦🇹🇨🇹🇩🇹🇫🇹🇬🇹🇭🇹🇯🇹🇰🇹🇱🇹🇲🇹🇳🇹🇴🇹🇷🇹🇹🇹🇻🇹🇼🇹🇿🇺🇦🇺🇬🇺🇲🇺🇳🇺🇸🇺🇾🇺🇿🇻🇦🇻🇨🇻🇪🇻🇬🇻🇮🇻🇳🇻🇺🇼🇫🇼🇸🇽🇰🇾🇪🇾🇹🇿🇦🇿🇲🇿🇼🏴󠁧󠁢󠁥󠁮🏴󠁧󠁢󠁳󠁣🏴󠁧󠁢󠁷󠁬',
}).map(e => {
    return { label: e[0], options: Array.from(e[1]).map(e => ({ value: e, label: e })) };
});
